{
  "content": " 116 Remote work has become an essential part of the modern workforce, and behind the scenes, there are unsung heroes making it all possible—business process outsourcing (BPO) companies. In a recent podcast interview, Liam Martin, the co-founder of Time Doctor and Running Remote, sat down with David Sudolsky, the founder of Boldr Impact, a mission-driven BPO company, to explore the unique perspective and impact of BPO companies in the remote work landscape. Listen to the full interview here:   Boldr Impact: Leading the charge in responsible outsourcing Boldr Impact stands out from average BPO companies by embracing a mission-driven approach. David Sudolsky has a soft spot for BPO companies, having spent a significant portion of his twenties in the Philippines, where he set up his first outsourcing company. However, after a personal crisis and reevaluating his life and business practices, David realized he wanted to build a company that served the community and team members instead of exploiting them. In 2016, he launched Boldr, a public benefit corporation and a B Corp that exists to help team members and communities thrive. The significance of being a B Corp in responsible outsourcing Being a B Corp is an essential part of Boldr’s identity. B Corps undergo a certification process that audits whether their internal practices align with their stated values. This auditing body verifies ethical operations and ensures that companies consider more than just their shareholders’ interests, taking into account the environment and local communities. B Corps promotes equality for team members and prioritizes distributing profits to employees. With around 6,000 B Corps worldwide, Boldr stands among those leading the charge for responsible business practices. Personal transformation as the root of ethical business decisions David openly shares his personal journey of self-reflection and transformation. After experiencing a personal crisis following the death of his business partner, he engaged in self-destructive behaviors and felt a deep misalignment between his actions and his internal values. Through therapy and deep reflection, he recognized his broken state and sought a new path. Personal growth became paramount to his success and the success of his business. Building an authentic company culture in outsourcing When David Sudolsky co-founded Boldr, he made a conscious effort to remove himself from the center, involving the team in decision-making processes. Through a co-creative process, the team identified their mission of supporting the youth in the Philippines and developed core values that aligned with his vision of authenticity. Although founders must maintain control to ensure their happiness with the company they build, inviting the team’s input is crucial for creating a positive and supportive work environment. Navigating challenges and red flags in a responsible outsourcing setting A topic not often discussed openly but addressed in the podcast is the concept of “fuckburgs” within organizations. Liam Martin and David Sudolsky emphasize the importance of identifying individuals who may, on the surface, seem fine but have problematic behaviors or attitudes below the surface. These individuals lack emotional trust from other team members and can significantly impact company culture. Organizations can uncover these hidden issues by conducting anonymous surveys and asking employees who they believe is the unsung hero and who is the “asshole” in their department. Although getting rid of fuckburgs can be challenging, it brings relief and renewed trust to the rest of the team. Sustainable growth: A testament to responsible outsourcing The journey of Boldr Impact serves as a case study in sustainable growth. After experiencing rapid expansion, the company realized the importance of hiring leaders aligned with their culture and values. They intentionally slowed down their growth to focus on maintaining their mission, values, and culture. Boldr aims to reach 5,000 team members in the next five to ten years while staying true to its values and mission. David Sudolsky advises BPO founders to consider growing slower instead of scaling rapidly. By doing so, founders can establish a strong foundation, maintain quality standards, and preserve their culture. Impact sourcing: A path to sustainable outsourcing One of the key takeaways from the interview is Boldr’s focus on impact sourcing. While many companies outsource to BPOs primarily for cost savings, impact sourcing elevates the outsourcing model to create positive social and economic results in underserved communities. Boldr Impact’s responsible outsourcing model invests in training and development programs to empower individuals in these communities. By incorporating an impact sourcing mindset and promoting responsible outsourcing business practices, BPOs can make a more significant and sustainable impact. The future of BPO: Elevating standards with responsible outsourcing BPO companies play a crucial role as the unsung heroes of remote work. They enable businesses to streamline operations and reduce costs. However, the industry needs to prioritize investing in communities outside of major cities and ensure that team members are treated well. Boulder Impact, with its mission-driven approach and focus on sustainability, serves as a shining example of how BPO companies can make a positive impact. By embracing responsible business practices and focusing on responsible outsourcing, BPOs have the potential to shape the future of remote work for the better.       Andy NguyenAndy is a technology & marketing leader who has delivered award-winning and world-first experiences.    "
}