{
  "content": " 82 You’ve trained a team of call center representatives, perfected your standard operating procedures (SOPs) and service-level agreements (SLAs), and successfully signed contact center clients. You’re ready to take on new contracts and scale your business plan. So, where should you look for new clients? Whether you’re relatively new to the industry or already well established, you have plenty of options to find more clients. In this article, we’ll cover 10 common (as well as little-known) ways to get call center contracts so you can continue to grow your business.  1. Check RFP sites The most straightforward way to get more clients is to respond to those businesses actively seeking contact center support. This tactic is especially beneficial if you’re a startup or a newer business owner. It doesn’t require industry contacts or client referrals. To find these prospects efficiently, check websites that list requests for proposals (RFPs) from businesses and agencies. There are tons of sites that list RFPs, and they all work a little differently. RFPMart and InstantMarkets are two of the most popular. RFPMart RFPMart lists RFPs from government agencies, ranging from the federal to local level. The site categorizes RFPs by service type, so you can quickly find agencies seeking call center support.  Each entry lists the agency’s location, start and end dates for the bidding period, and scope of work. This setup helps you easily gauge whether the RFP might be a good fit for your contact center. The only catch is you can’t respond to the RFP directly from this site. You need to pay to download each RFP, which typically costs $5 to $10. Compared to the potential contract revenue, these expenses are relatively minor. InstantMarkets InstantMarkets uses an advanced filtering system to sort RFPs by keyword, opportunity source, location, and date. Like RFPMart, InstantMarkets lists the government agency, bidding period, and scope of work for each RFP. Unlike RFPMart, InstantMarkets publishes links to the original RFP. That means, in many cases, you can view the RFP and submit a proposal without paying a fee to the listing site. Additional resources for understanding RFP’s The RFP Process ExplainedHow to Find RFPs and Win Them 2. Start a referral program If you’re a more established contact center CXO (chief experience officer), you already have access to an invaluable resource for growing your business. Ask your current clients or business partners for referrals to other local businesses in their industry. You can certainly make one-off requests. However, if you’re serious about growing your small business, take the time to set up a referral program. With this program, you can standardize the referral process, incentivize clients to recommend you, and track the results. For example, by using a platform like Referral Rock, you can set up a program, create incentives, and manage marketing assets. Then, you can promote the program consistently, testing messages and finding what resonates with your clients. Since these platforms typically generate unique referral codes, you can easily tie any new inquiries back to the original client. You can then deliver the incentive promptly and encourage your top clients to continue referring you. Consider the incentive and contract terms carefully. Many service-based businesses offer a flat fee, often in the form of a gift card. Alternatively, you could proffer a percentage of new contracts either upfront or over time. Additional resources to help you start a referral program Referral Marketing 101How to Build a Customer Referral Program That Wins More Clients 3. Partner with a BPO agency Business partners can make excellent referral sources. But including them in a client referral program isn’t always the best approach. To leverage this option, consider establishing a relationship with a business process outsourcing (BPO) agency. BPO agencies specialize in handling outsourced services for other businesses that don’t want them managed in-house. That means BPOs often seek partnerships with service providers to connect with prospects. One way to start is by contacting some of the top BPO agencies to learn about their partnership opportunities. You can evaluate all the available options and decide which to prioritize. Keep in mind that many BPO firms work with service providers in specific industries and certain geographic areas. So, you want to look for an agency that typically provides virtual call center services in your region. Additional resources for partnering with BPO’s The 23 Top BPO Companies in the WorldHow to Find and Hire the Best BPO Company 4. Network at in-person events Whether you’re new to the contact center industry or have been managing call centers for years, networking at in-person events can be one of the most effective ways to connect with potential clients.  As you map out your event schedule for the year, consider two different ways to approach this tactic. Attend contact center industry events If you want to level up your services and make connections in the industry, attending a major annual event like the Call and Contact Center Expo is a good choice. At these events, you can learn from industry experts, discover new call center software, and connect with peers. Some of the attendees might be BPO owners and other organizations seeking partnerships. However, keep in mind many of the other attendees might be competitors. Network at clients’ industry events To get your business in front of potential clients, identify their professional organizations and attend those industry events instead. In most cases, there is less competition and more opportunities to connect with prospects. For example, say you manage inbound call centers for retail outlets or outbound calls for development agencies. Research the industry’s top events and explore opportunities for vendors. Sometimes, you can sponsor the event, which can help you get press and put your business in the spotlight. Additional resources for learning how to network at events How to Network at ConferencesHow to Network at a Conference: 10 Ways to Make Contacts Like a Pro 5. Showcase your success The longer you’re in business, and the more wins you tally, the better you can showcase your success. By showing prospects what you’ve helped clients achieve, you can create better opportunities to win more call center contracts. Let’s review two of the most effective ways to convey your success to potential customers. Collect customer testimonials The easiest way to share what you’ve achieved is to capture your clients’ glowing reviews of your services. Ask for testimonials so prospects can hear about your services in your clients’ own voices. When asking for testimonials, be strategic. Create a simple testimonial template with some questions likely to produce short quotes you can easily share. Be sure to ask clients for permission to share their words on your website, social media channels, or in your print marketing. Testimonials tend to hold more weight when accompanied by an actual person’s name and headshot rather than an anonymous title. Create case studies If you’ve achieved truly remarkable results for clients, share your accomplishments via a case study. For example, you could explain how you helped a customer achieve an ambitious average handle time (AHT), average speed of answer (ASA), or first call resolution (FCR) goal. Most case studies follow a simple formula: highlight the problem, explain the approach to solve it, and describe the outcome. To create compelling case studies, you need metrics to share specific results. For a case study that really resonates, ask the client to participate. Recording a short video testimonial can be even better for highlighting customer satisfaction. Additional resources for collecting testimonials and creating case studies The Ultimate Guide for Collecting and Using TestimonialsHow to Write a Case Study  6. Leverage content marketing If you create case studies, you can publish them on your website so prospects can easily find them. As beneficial as they can be for converting new clients, they’re just one type of content you can use to market your business. Search engine optimization (SEO) is a less expensive and easier content marketing strategy for many business owners. With SEO, you can create website content (e.g., blog posts) that addresses your target audience’s problems and explains how your services can solve them. To do SEO effectively, you typically need to choose topics relevant to your business, do keyword research, and create optimized content for those keywords. SEO platforms like Semrush and Ahrefs can help with all of these steps. When you publish these blog posts, include calls to action (CTAs), prompting prospects to take the next step. Depending on the search intent behind the blog post, a logical next step might be learning more about the topic, reading a relevant case study, or contacting your team to learn about call center prices. Note that SEO and content marketing can be one of the most cost-effective approaches to getting new clients. These tactics can work no matter how established your business is. However, they often take several months or even a year to have an effect, so they’re more long-term plays. Additional resources on learning how to do content marketing The Ultimate Guide to Content MarketingThe SEO’s Guide to Content Marketing 7. Run pay-per-click ads In contrast to SEO, pay-per-click (PPC) ads often have a much more immediate effect. Though results aren’t guaranteed, the average cost per lead for business services is $87.04 in 2023. Depending on your target audience and budget, running ads across Google, Bing, and social media platforms may make sense. Hiring an agency is often a good idea if you’re new to PPC.  Curious where to look or how to get your money’s worth? Start with a site like Clutch. Here, you can browse a lot of potential agency partners, read reviews from past customers, and get a sense of the cost before taking the next step. Additional resources on PPC ads What Is PPC? Learn the Basics of Pay-Per-Click MarketingThe Ultimate Guide to PPC Marketing 8. Use social media marketing If your business has a strong presence on social media, you can connect with prospective clients and nurture them over time. For service providers like call centers, organic social media marketing usually has two components. Market your business First, create a social media content strategy for your business. For example, you can share links to the blog posts you’ve published or promote your latest customer testimonials. You can also share content, memes, and industry news of interest to your target market. Be sure to create content for the platforms where your ideal customer spends time. Generally, this list includes LinkedIn, Facebook, and X/Twitter. Connect with prospects Instead of employing social media solely as a promotional tool, use it to engage with prospects. Identify the businesses you want to work with and follow them on social media. Make a point of engaging with their content. On LinkedIn, you can make these connections more personal. In addition to connecting from your company page, have your executive team connect with potential clients directly through their personal profiles. Genuinely engage with their content and build a relationship before making a sales pitch. Additional resources on social media marketing Social Media Lead Generation: 13 Proven TacticsCall Center Social Media Marketing Plan Template 9. Upsell current clients If you’re an established outsourced call center agency, you likely have a specialty. For example, you may offer call center or live chat support services to a particular industry or region or focus strictly on either inbound or outbound services. Consider expanding your services, then upsell your current clients rather than strictly seeking new business. For instance, as an inbound agency focused on customer service, adding tech support to your offerings might make sense. Additional resources on learning on how to upsell How to Upsell Services Without Being PushyUpselling Clients: 8 Strategies to Expand Your Accounts 10. Make outbound sales calls Whether upselling current clients or pitching existing offerings, outbound campaigns can be incredibly effective for connecting directly with potential customers. If your team specializes in outbound sales, you could add outreach to your top reps’ to-do lists. You need a list of prospects to run a successful call center campaign. If you’ve been investing in building out your LinkedIn network, you can create a list directly from that social media platform. You also need a cold call script that grabs prospects’ attention, briefly introduces your service, and prompts a next step. Typically, this approach requires following up with another call, email, or LinkedIn message. You can eventually convert cold calls into satisfied customers by nurturing these leads.  Additional resources on outbound sales Cold Calling Guide With Proven Tips and ExamplesOutbound Cold Calling: What It Is and How to Do It Right Get the tools you need to grow your business The more you sign new clients and grow your business, the more having the right tools becomes essential. Time Doctor’s time tracking platform is ideal for outsourced call centers, making it easy to monitor employee attendance, track workday activity, create time sheets efficiently, and review productivity analytics. Ready to discover how our call center software and productivity analytics platform can benefit your contact center? Book a demo with Time Doctor and see how it can contribute to your growing call center’s success.       Andy NguyenAndy is a technology & marketing leader who has delivered award-winning and world-first experiences.    "
}